{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"Kotlin y FizzBuzz","path":"/kotlin-y-fizzbuzz","date":"2017-07-02","tags":["Kotlin"],"excerpt":"Kotlin, es un lenguaje de programación creado por JetBrains que corre en la JVM (Java Virtual Machine) que se ha puesto de moda, Google le ha dado soporte oficial para Android y el framework web por excelencia de Java Spring también le da soporte"}}},{"node":{"frontmatter":{"title":"Angular vs React: ngIf vs Operador ternario","path":"/angular-vs-react-ngif-vs-operador-ternario/","date":"2017-01-17","tags":["The Battle of Frameworks"],"excerpt":"En la entrada de hoy vamos aprender como funciona la representación de elementos del DOM dependiendo de la lógica de nuestros componentes tanto como en Angular como en React. El ejemplo que llevaremos a cabo contiene  un reloj el cuál cuando llegue a las 3:14 el texto que se mostrará en pantalla cambiará a “Hora PI”, por"}}},{"node":{"frontmatter":{"title":"Qué puede aprender un programador web en 2017","path":"/que-puede-aprender-un-programador-web-en-2017/","date":"2017-01-01","tags":["Personal"],"excerpt":"Para el nuevo año, necesitamos aumentar nuestro toolbox para no quedarnos estancados, para mí esto es lo que necesitará un desarrollador web de 2017 Empezamos por la categoría de CSS Aprender Flexbox, si es que no lo has aprendido ya, flexbox proporciona al desarrollador la habilidad de predecir cómo se van a comportar los elementos de"}}},{"node":{"frontmatter":{"title":"VINI, VIDI, VICI, AVICII","path":"/vini-vidi-vici-avicii/","date":"2016-03-29","tags":["Tribute"],"excerpt":"Repaso a las mejores canciones de AVICII, desde el año 2009 hasta el 2016"}}},{"node":{"frontmatter":{"title":"Una aplicación con ReactJS","path":"/una-aplicacion-con-reactjs/","date":"2016-02-14","tags":["Pet Projects"],"excerpt":"En los últimos meses, llevo aprendiendo la librería ReactJS. El objetivo de esta librería es que los desarrolladores nos concentremos en desarrollar componentes para nuestras vistas. Para aprender lo mejor que he hecho es construir, es decir me he puesto a desarrollar una aplicación para resolver un problema que tenía."}}}]}},"pageContext":{}}