{"data":{"markdownRemark":{"html":"<p>En los últimos meses, llevo aprendiendo la librería <strong>ReactJS</strong>. El objetivo de esta librería es que los desarrolladores nos concentremos en desarrollar componentes para nuestras vistas. </p>\n<p>Para aprender lo mejor que he hecho es construir, es decir me he puesto a desarrollar una aplicación para resolver un problema que tenía. </p>\n<p>El problema que tenía es que quería guardar las palabras que salen en películas o en series que no entendía. </p>\n<p>Para ello necesitaba un base de datos y desarrollar una interfaz para guardar esos datos. </p>\n<p>Para este proyecto he usado <strong>SailsJS</strong> que tiene varios adaptadores para varias bases de datos como <strong>MYSQL</strong> o <strong>MongoDB</strong>. Además después de declarar nuestro modelo de datos, genera las tablas en la base de datos y nos da una <strong>API Rest</strong>, ya hecha. </p>\n<p>Para la interfaz he usado <strong>ReactJS</strong>, con react-router para que haga la función de router, he usado <strong>Webpack</strong> para que me compile el código es6 a es5 con <strong>BabelJS</strong>, además de usar react-hot-reloading para que los cambios que vaya haciendo, haga que el navegador se actualice por si solo. </p>\n<p>Para subir el proyecto, he usado <strong>Heroku</strong> que me ofrece una base de datos <strong>MySQL</strong> gratuita. </p>\n<p>El proyecto se puede ver en el siguiente enlace: <a href=\"https://learnseries.herokuapp.com/\" target=\"_blank\">https://learnseries.herokuapp.com/</a> Además tanto el código de <strong>SailsJS</strong>, como de la interfaz se encuentran en los siguientes enlaces: </p>\n<p><a href=\"https://github.com/gabrielseco/sailslearnseries\" target=\"_blank\">https://github.com/gabrielseco/sailslearnseries</a></p>\n<p><a href=\"https://github.com/gabrielseco/series\" target=\"_blank\">https://github.com/gabrielseco/series</a></p>","frontmatter":{"title":"Una aplicación con ReactJS","tags":["Pet Projects"],"subtitle":"","featured_image":{"publicURL":"/ggseco-gatsby-v3/static/code-8d9438e0a4f0b35c0fda80023af522bc.jpg"}}}},"pageContext":{"pathSlug":"/una-aplicacion-con-reactjs/"}}