{"data":{"markdownRemark":{"html":"<p>En la entrada de hoy vamos aprender como funciona la representación de elementos del DOM dependiendo de la lógica de nuestros componentes tanto como en <strong>Angular</strong> como en <strong>React</strong>. </p>\n<p>El ejemplo que llevaremos a cabo contiene  un reloj el cuál cuando llegue a las <strong>3:14</strong> el texto que se mostrará en pantalla cambiará a \"Hora PI\", por supuesto la hora es relativa y se puede cambiar para ver que funciona correctamente el ejemplo. </p>\n<p><strong>Angular 2.0</strong> en su nueva versión, nos proporciona la directiva en <strong>*ngIf</strong> la cual evalúa una expresión dada, si es la expresión dada es correcta nos renderizará nuestro elemento en el DOM y si no lo es lo descartará. </p>\n<p>Se puede ver la demo en el siguiente <a href=\"https://embed.plnkr.co/lCAFUIK84ttUkSqnrOvH/\">plunker</a> </p>\n<p>Este trozo de código lo que hace el componente al inicializarse  es asignar la hora objetivo en el constructor, después de que se inicializa, se lanza el evento <strong>ngAfterContentInit</strong> el cual contiene un intervalo que se ejecuta cada segundo, finalmente en la template se realiza la comprobación con <strong>*ngIf</strong> </p>\n<p>Si tuviésemos que realizar el siguiente ejemplo en <strong>React</strong> nos tendríamos que olvidar de la estructura if, pero podemos usar el operador ternario, el cuál funciona perfectamente como if /else </p>\n<p>El ejemplo en <strong>React</strong> se puede ver en el siguiente <a href=\"http://codepen.io/GGarciaSeco/pen/ggwPpp\">codepen</a> </p>\n<p>Este trozo de código lo que hace el componente al inicializarse  es asignar la hora objetivo en el constructor, además de pasar las dos horas al estado del componente después de que se monta el componente, se lanza el evento <strong>componentDidMount</strong> el cual contiene un intervalo que se ejecuta cada segundo actualizando el estado de actualTime y por último en la función render hay un operador ternario que en base a la variable difference hace que se muestre un contenido u otro. </p>\n<p><strong>Nota:</strong> Este artículo será modificado si Angular 4.0 saque las mejoras respecto al <strong>ngIf</strong></p>","frontmatter":{"title":"Angular vs React: ngIf vs Operador ternario","tags":["The Battle of Frameworks"],"subtitle":"","featured_image":{"publicURL":"/static/angular_vs_react-f96fb1f88f1329688e22152e5a87bcfd.png"}}}},"pageContext":{"pathSlug":"/angular-vs-react-ngif-vs-operador-ternario/"}}